"""

เลือกโจทย์ โปรแกรมคำนวณเกรดจากคะแนน (A/B/C/D/F)
I : จำนวนคะแนน (score) 
P: sc < 50 = F sc >= 50 = D sc >= 60 = C sc >= 70 = B sc >= 80 = A
O : เกรดที่ได้
ตัวแปร : sc (score) , grade

"""
print("📘 สวัสดีครับ โปรแกรมคำนวณเกรดพร้อมแล้วครับ")

try:
    sc = float(input("กรอกคะแนน (0-100): "))

    if 0 <= sc <= 100:

        if sc >= 80:
            grade = "A"
        elif sc >= 75:
            grade = "B+"
        elif sc >= 70:
            grade = "B"
        elif sc >= 65:
            grade = "C+"
        elif sc >= 60:
            grade = "C"
        elif sc >= 55:
            grade = "D+"
        elif sc >= 50:
            grade = "D"
        else:
            grade = "F"

        print("เกรดที่ได้คือ:", grade)

    else:
        print("❌ คะแนนต้องอยู่ระหว่าง 0 ถึง 100")

except ValueError:
    print("❌ กรุณากรอกตัวเลขเท่านั้น")

print("เขียนโปรแกรมโดย ณัฐพงศ์")
